app/controllers/votes_controller.rb

SELECT * FROM "topics" WHERE ("topics"."id" = 4)
INSERT INTO "votes" ("topic_id", "updated_at", "created_at") VALUES(4, '2009-06-13 22:40:59', '2009-06-13 22:40:59')
---
  def create
    @topic= Topic.find(params[:topic_id])
    @vote= @topic.votes.create!